<h3> Chicago Dataset: Socioeconomic Indicators, Public Schools, Crime Data </h3>

In [34]:
import sqlalchemy as sa
from urllib.parse import quote_plus
import os
#!pip install mysqlclient
import pandas as pd

In [43]:
user = os.environ.get('DB_USER')
password = quote_plus(os.environ.get('DB_PASSWORD'))
host = os.environ.get('DB_HOST')
database = 'US_CITIES'
engine_arg = f"mysql+mysqldb://{user}:{password}@{host}/{database}?charset=utf8mb4"
connecting_string = f"mysql://{user}:{password}@{host}/{database}"
print(engine_arg)

db = sa.create_engine(engine_arg)
conn = db.connect()

mysql+mysqldb://root:password123%21%40%23ABC@127.0.0.1/US_CITIES?charset=utf8mb4

In [39]:
#Creating the Tables
cvs_links = {
"chicago_census":"https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCensusData.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01",
"chicago_public_schools":"https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoPublicSchools.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01",
"chicago_crime":"https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCrimeData.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01"
}

for name, links in cvs_links.items():
    print(f"Creating Table for {name}")
    df = pd.read_csv(links)
    df.to_sql(name, conn, if_exists='replace', index=False,method="multi")

Creating Table for chicago_census
Creating Table for chicago_public_schools
Creating Table for chicago_crime

In [44]:
%load_ext sql
%sql $connecting_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [47]:
#Problem1: num of crimes
%sql select count(*) from chicago_crime;

 * mysql://root:***@127.0.0.1/US_CITIES
1 rows affected.

[(533,)]

In [48]:
#Problem2: List community area names and numbers with per capita income less than 11000.

%sql select COMMUNITY_AREA_NAME , PER_CAPITA_INCOME from chicago_census \
    where PER_CAPITA_INCOME < 11000

 * mysql://root:***@127.0.0.1/US_CITIES
4 rows affected.

[('West Garfield Park', 10934),
 ('South Lawndale', 10402),
 ('Fuller Park', 10432),
 ('Riverdale', 8201)]

In [54]:
#Problem3: List all case numbers for crimes involving minors?(children are not considered minors for the purposes of crime analysis) 
%sql select ID, case_number ,primary_type, description from chicago_crime where primary_type = "OFFENSE INVOLVING CHILDREN";

 * mysql://root:***@127.0.0.1/US_CITIES
4 rows affected.

[(5766654, 'HN567387', 'OFFENSE INVOLVING CHILDREN', 'AGG SEX ASSLT OF CHILD FAM MBR'),
 (6986273, 'HR391350', 'OFFENSE INVOLVING CHILDREN', 'SEX ASSLT OF CHILD BY FAM MBR'),
 (5176248, 'HM768251', 'OFFENSE INVOLVING CHILDREN', 'CRIM SEX ABUSE BY FAM MEMBER'),
 (8159639, 'HT394616', 'OFFENSE INVOLVING CHILDREN', 'AGG CRIM SEX ABUSE FAM MEMBER')]

In [122]:
#Problem4: List all kidnapping crimes involving a child?
%sql select ID, case_number, primary_type, description from chicago_crime where primary_type = "KIDNAPPING" and description like "%CHILD%";

 * mysql://root:***@127.0.0.1/US_CITIES
1 rows affected.

[(5276766, 'HN144152', 'KIDNAPPING', 'CHILD ABDUCTION/STRANGER')]

In [62]:
#Problem5: List the kind of crimes that were recorded at schools. (No repetitions)
%sql select distinct primary_type from chicago_crime \
    where location_description like "%school%"

 * mysql://root:***@127.0.0.1/US_CITIES
6 rows affected.

[('BATTERY',),
 ('CRIMINAL DAMAGE',),
 ('NARCOTICS',),
 ('ASSAULT',),
 ('CRIMINAL TRESPASS',),
 ('PUBLIC PEACE VIOLATION',)]

In [72]:
#Problem6: List the type of schools along with the average safety score for each type
%sql select `Elementary, Middle, or High School`, count(`Elementary, Middle, or High School`) , avg(SAFETY_SCORE)  from chicago_public_schools \
    group by `Elementary, Middle, or High School`

 * mysql://root:***@127.0.0.1/US_CITIES
3 rows affected.

[('ES', 462, 49.52038369304557),
 ('HS', 93, 49.62352941176471),
 ('MS', 11, 48.0)]

In [80]:
#Problem6: list 5 community areas with highest % of households below poverty line
%sql select COMMUNITY_AREA_NAME, PERCENT_HOUSEHOLDS_BELOW_POVERTY \
    from chicago_census \
    order by PERCENT_HOUSEHOLDS_BELOW_POVERTY desc limit 5;

 * mysql://root:***@127.0.0.1/US_CITIES
5 rows affected.

[('Riverdale', 56.5),
 ('Fuller Park', 51.2),
 ('Englewood', 46.6),
 ('North Lawndale', 43.1),
 ('East Garfield Park', 42.4)]

In [111]:
#Problem8: Which community area is most crime prone? Display the commuinty area number only.
%sql select crime.COMMUNITY_AREA_NUMBER, \
        (select COMMUNITY_AREA_NAME from chicago_census census \
        where crime.COMMUNITY_AREA_NUMBER = census.COMMUNITY_AREA_NUMBER) as Community_Area_Name, \
    count(crime.COMMUNITY_AREA_NUMBER) as Number_of_Occurences\
    from chicago_crime crime  \
    group by crime.COMMUNITY_AREA_NUMBER \
    order by count(crime.COMMUNITY_AREA_NUMBER) desc limit 5

 * mysql://root:***@127.0.0.1/US_CITIES
5 rows affected.

[(25.0, 'Austin', 43),
 (23.0, 'Humboldt park', 22),
 (68.0, 'Englewood', 21),
 (28.0, 'Near West Side', 16),
 (29.0, 'North Lawndale', 16)]

In [123]:
#Problem9: Use a sub-query to find the name of the community area with highest hardship index 
%sql select COMMUNITY_AREA_NUMBER, Community_Area_Name, HARDSHIP_INDEX from chicago_census \
    where HARDSHIP_INDEX in (select max(HARDSHIP_INDEX) from chicago_census)

 * mysql://root:***@127.0.0.1/US_CITIES
1 rows affected.

[(54.0, 'Riverdale', 98.0)]

In [112]:
#Problem10: Use a sub-query to determine the Community Area Name with most number of crimes?
%sql select crime.COMMUNITY_AREA_NUMBER, \
        (select COMMUNITY_AREA_NAME from chicago_census census \
        where crime.COMMUNITY_AREA_NUMBER = census.COMMUNITY_AREA_NUMBER) as Community_Area_Name, \
    count(crime.COMMUNITY_AREA_NUMBER) as Number_of_Occurences\
    from chicago_crime crime  \
    group by crime.COMMUNITY_AREA_NUMBER \
    order by count(crime.COMMUNITY_AREA_NUMBER) desc limit 5

 * mysql://root:***@127.0.0.1/US_CITIES
5 rows affected.

[(25.0, 'Austin', 43),
 (23.0, 'Humboldt park', 22),
 (68.0, 'Englewood', 21),
 (28.0, 'Near West Side', 16),
 (29.0, 'North Lawndale', 16)]

In [118]:
conn.close()
engine.dispose()